yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
#ifndef USE_USBD_COMPOSITE
/* USB AUDIO device Configuration Descriptor */
__ALIGN_BEGIN static uint8_t USBD_AUDIO_CfgDesc[USB_AUDIO_CONFIG_DESC_SIZ] __ALIGN_END =
    {
        /* Configuration 1 */
        0x09,                              /* bLength */
        USB_DESC_TYPE_CONFIGURATION,       /* bDescriptorType */
        LOBYTE(USB_AUDIO_CONFIG_DESC_SIZ), /* wTotalLength */
        HIBYTE(USB_AUDIO_CONFIG_DESC_SIZ),
        0x03, /* bNumInterfaces */
        0x01, /* bConfigurationValue */
        0x00, /* iConfiguration */
    #if (USBD_SELF_POWERED == 1U)
        0xC0, /* bmAttributes: Bus Powered according to user configuration */
    #else
        0x80, /* bmAttributes: Bus Powered according to user configuration */
    #endif              /* USBD_SELF_POWERED */
        USBD_MAX_POWER, /* MaxPower (mA) */
        /* 09 byte(9)*/

        /* USB Speaker Standard interface descriptor */
        AUDIO_INTERFACE_DESC_SIZE,   /* bLength */
        USB_DESC_TYPE_INTERFACE,     /* bDescriptorType */
        0x00,                        /* bInterfaceNumber */
        0x00,                        /* bAlternateSetting */
        0x00,                        /* bNumEndpoints */
        USB_DEVICE_CLASS_AUDIO,      /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOCONTROL, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,    /* bInterfaceProtocol */
        0x00,                        /* iInterface */
        /* 09 byte(18)*/

        /* USB Speaker Class-specific AC Interface Descriptor */
        0x0A,                            /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE, /* bDescriptorType */
        AUDIO_CONTROL_HEADER,            /* bDescriptorSubtype */
        0x00, /* 1.00 */                 /* bcdADC */
        0x01,
        0x48, /* wTotalLength */
        0x00,
        0x02, /* bInCollection */
        0x01, /* baInterfaceNr */
        0x02,
        /* 10 byte(28)*/

        /* USB Speaker Input Terminal Descriptor */
        AUDIO_INPUT_TERMINAL_DESC_SIZE,  /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE, /* bDescriptorType */
        AUDIO_CONTROL_INPUT_TERMINAL,    /* bDescriptorSubtype */
        0x01,                            /* bTerminalID */
        0x01,                            /* wTerminalType AUDIO_TERMINAL_USB_STREAMING   0x0101 */
        0x01,
        0x00, /* bAssocTerminal */
        0x02, /* bNrChannels */
        0x03, /* wChannelConfig 0x0000  Mono */
        0x00,
        0x00, /* iChannelNames */
        0x00, /* iTerminal */
        /* 12 byte(40)*/

        /* USB Speaker Audio Feature Unit Descriptor */
        0x0A,                            /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE, /* bDescriptorType */
        AUDIO_CONTROL_FEATURE_UNIT,      /* bDescriptorSubtype */
        AUDIO_OUT_STREAMING_CTRL,        /* bUnitID */
        0x01,                            /* bSourceID */
        0x01,                            /* bControlSize */
        AUDIO_CONTROL_MUTE,              /* bmaControls(0) */
        0,                               /* bmaControls(1) */
        0,                               /* bmaControls(2) */
        0x00,                            /* iTerminal */
        /* 10 byte(50)*/

        /* USB Speaker Output Terminal Descriptor */
        0x09,                            /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE, /* bDescriptorType */
        AUDIO_CONTROL_OUTPUT_TERMINAL,   /* bDescriptorSubtype */
        0x03,                            /* bTerminalID */
        0x01,                            /* wTerminalType  0x0301 */
        0x03,
        0x00, /* bAssocTerminal */
        0x02, /* bSourceID */
        0x00, /* iTerminal */
        /* 09 byte(59) */

        /* ---- Record path: IT (LineIn 2ch) -> FU -> OT (USB Streaming) ---- */
        /* Input Terminal (LINE IN 2ch) [ID = 0x11] */
        0x0C, 0x24, 0x02,    /* bLength=12, CS_INTERFACE, INPUT_TERMINAL */
        0x11,                /* bTerminalID */
        0x02, 0x06,          /* wTerminalType = 0x0602 (Line Connector). MICなら 0x01,0x02 */
        0x00,                /* bAssocTerminal */
        USBD_AUDIO_CHANNELS, /* bNrChannels = 2 */
        0x03, 0x00,          /* wChannelConfig = L|R */
        0x00,                /* iChannelNames */
        0x00,                /* iTerminal */
                             /* 12 byte(71)*/

        /* Feature Unit (Record) [ID = 0x12, Source = IT(0x11)] */
        0x0A, 0x24, 0x06, /* bLength=10, CS_INTERFACE, FEATURE_UNIT */
        0x12,             /* bUnitID */
        0x11,             /* bSourceID */
        0x01,             /* bControlSize = 1 */
        0x01,             /* bmaControls(0): Mute on Master */
        0x00,             /* bmaControls(1) */
        0x00,             /* bmaControls(2) */
        0x00,             /* iFeature */
                          /* 10 byte(81)*/

        /* Output Terminal (USB Streaming) [ID = 0x13, Source = FU(0x12)] */
        0x09, 0x24, 0x03, /* bLength=9, CS_INTERFACE, OUTPUT_TERMINAL */
        0x13,             /* bTerminalID */
        0x01, 0x01,       /* wTerminalType = 0x0101 (USB Streaming) */
        0x00,             /* bAssocTerminal */
        0x12,             /* bSourceID */
        0x00,             /* iTerminal */
                          /* 09 byte(90)*/

        /* USB Speaker Standard AS Interface Descriptor - Audio Streaming Zero Bandwidth */
        /* Interface 1, Alternate Setting 0                                              */
        AUDIO_INTERFACE_DESC_SIZE,     /* bLength */
        USB_DESC_TYPE_INTERFACE,       /* bDescriptorType */
        0x01,                          /* bInterfaceNumber */
        0x00,                          /* bAlternateSetting */
        0x00,                          /* bNumEndpoints */
        USB_DEVICE_CLASS_AUDIO,        /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOSTREAMING, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,      /* bInterfaceProtocol */
        0x00,                          /* iInterface */
        /* 09 byte(99)*/

        /* USB Speaker Standard AS Interface Descriptor - Audio Streaming Operational */
        /* Interface 1, Alternate Setting 1                                           */
        AUDIO_INTERFACE_DESC_SIZE,     /* bLength */
        USB_DESC_TYPE_INTERFACE,       /* bDescriptorType */
        0x01,                          /* bInterfaceNumber */
        0x01,                          /* bAlternateSetting */
        0x02,                          /* bNumEndpoints */
        USB_DEVICE_CLASS_AUDIO,        /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOSTREAMING, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,      /* bInterfaceProtocol */
        0x00,                          /* iInterface */
        /* 09 byte(108)*/

        /* USB Speaker Audio Streaming Interface Descriptor */
        AUDIO_STREAMING_INTERFACE_DESC_SIZE, /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_STREAMING_GENERAL,             /* bDescriptorSubtype */
        0x01,                                /* bTerminalLink */
        0x01,                                /* bDelay */
        0x01,                                /* wFormatTag AUDIO_FORMAT_PCM  0x0001 */
        0x00,
        /* 07 byte(115)*/

        /* USB Speaker Audio Type I Format Interface Descriptor */
        0x0B,                               /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,    /* bDescriptorType */
        AUDIO_STREAMING_FORMAT_TYPE,        /* bDescriptorSubtype */
        AUDIO_FORMAT_TYPE_I,                /* bFormatType */
        USBD_AUDIO_CHANNELS,                /* bNrChannels */
        USBD_AUDIO_SUBFRAME_BYTES,          /* bSubFrameSize :  3 Bytes per frame (24bits) */
        USBD_AUDIO_RES_BITS,                /* bBitResolution (24-bits per sample) */
        0x01,                               /* bSamFreqType only one frequency supported */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ), /* Audio sampling frequency coded on 3 bytes */
                                            /* 11 byte(126)*/

        /* Endpoint 1 - Standard Descriptor */
        AUDIO_STANDARD_ENDPOINT_DESC_SIZE,           /* bLength */
        USB_DESC_TYPE_ENDPOINT,                      /* bDescriptorType */
        AUDIO_OUT_EP,                                /* bEndpointAddress 1 out endpoint */
        USBD_EP_TYPE_ISOC | USBD_EP_ATTR_ISOC_ASYNC, /* bmAttributes */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ),      /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(HalfWord)) */
        AUDIO_HS_BINTERVAL,                          /* bInterval */
        0x00,                                        /* bRefresh */
        AUDIO_FB_EP,                                 /* bSynchAddress */
        /* 09 byte(135)*/

        /* Endpoint - Audio Streaming Descriptor */
        AUDIO_STREAMING_ENDPOINT_DESC_SIZE, /* bLength */
        AUDIO_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_ENDPOINT_GENERAL,             /* bDescriptor */
        0x00,                               /* bmAttributes */
        0x00,                               /* bLockDelayUnits */
        0x00,                               /* wLockDelay */
        0x00,
        /* 07 byte(142)*/

