yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
        /* Feedback IN Endpoint (Standard, 9B) */
        AUDIO_FEEDBACK_ENDPOINT_DESC_SIZE, /* bLength */
        USB_DESC_TYPE_ENDPOINT,            /* bDescriptorType: ENDPOINT */
        AUDIO_FB_EP,                       /* bEndpointAddress: IN */
        USBD_EP_TYPE_ISOC | 0x10,          /* bmAttributes: Isoch | Usage=Feedback */
        0x03,
        0x00,               /* wMaxPacketSize = 3 bytes (HS:10.14) */
        AUDIO_FB_BINTERVAL, /* bInterval: 1ms (=2^(4-1) µframes) */
        0x00,               /* bRefresh */
        0x00,               /* bSynchAddress=0 */
                            /* 09 byte(151) */

        /* ---------------- AS(IN) Interface #2 ---------------- */
        /* Std AS Interface, alt 0 */
        0x09, 0x04,       /* INTERFACE */
        0x02,             /* bInterfaceNumber = 2 */
        0x00,             /* bAlternateSetting = 0 */
        0x00,             /* bNumEndpoints = 0 */
        0x01, 0x02, 0x00, /* AUDIO, AUDIO_STREAMING */
        0x00,
        /* 09 byte(160)*/

        /* Std AS Interface, alt 1 */
        0x09, 0x04,       /* INTERFACE */
        0x02,             /* bInterfaceNumber = 2 */
        0x01,             /* bAlternateSetting = 1 */
        0x01,             /* bNumEndpoints = 1 (IN) */
        0x01, 0x02, 0x00, /* AUDIO, AUDIO_STREAMING */
        0x00,
        /* 09 byte(169)*/

        /* CS AS General (link to OT USB Streaming = 0x13) */
        0x07, 0x24, 0x01, /* bLength=7, CS_INTERFACE, AS_GENERAL */
        0x13,             /* bTerminalLink = 0x13 */
        0x01,             /* bDelay */
        0x01, 0x00,       /* wFormatTag = PCM */
        /* 07 byte(176)*/

        /* Type I Format (2ch, 16bit, 48kHz) */
        0x0B, 0x24, 0x02,                   /* bLength=11, CS_INTERFACE, FORMAT_TYPE */
        0x01,                               /* FORMAT_TYPE_I */
        USBD_AUDIO_CHANNELS,                /* 2ch */
        USBD_AUDIO_SUBFRAME_BYTES,          /* 24-bit (3 bytes) */
        USBD_AUDIO_RES_BITS,                /* 24 bits */
        0x01,                               /* 1 discrete freq */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ), /* Audio sampling frequency coded on 3 bytes */
        /* 11 byte(187)*/

        /* Std ISO Endpoint (IN) 0x81, Async (0x05), 1ms, 288B */
        0x09, 0x05,                             /* ENDPOINT */
        AUDIO_IN_EP,                            /* bEndpointAddress = 0x81 (IN) */
        0x05,                                   /* bmAttributes = Isochronous | Asynchronous | Data */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ), /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(Word)) */
        AUDIO_HS_BINTERVAL,                     /* bInterval */
        0x00,                                   /* bRefresh */
        0x00,                                   /* bSynchAddress */
        /* 09 byte(196)*/

        /* CS ISO Endpoint (IN) */
        0x07, 0x25, 0x01, /* CS_ENDPOINT, EP_GENERAL */
        0x00,             /* bmAttributes */
        0x00,             /* bLockDelayUnits */
        0x00, 0x00        /* wLockDelay */
                          /* 07 byte(203)*/
};

/* USB Standard Device Descriptor */
__ALIGN_BEGIN static uint8_t USBD_AUDIO_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END =
    {
        USB_LEN_DEV_QUALIFIER_DESC,
        USB_DESC_TYPE_DEVICE_QUALIFIER,
        0x00,
        0x02,
        0x00,
        0x00,
        0x00,
        0x40,
        0x01,
        0x00,
};
#endif /* USE_USBD_COMPOSITE  */

static uint8_t AUDIOOutEpAdd = AUDIO_OUT_EP;
static uint8_t AUDIOFbEpAdd  = AUDIO_FB_EP;
static uint8_t AUDIOInEpAdd  = AUDIO_IN_EP;
/**
 * @}
 */

/** @defgroup USBD_AUDIO_Private_Functions
 * @{
 */

/**
 * @brief  USBD_AUDIO_Init
 *         Initialize the AUDIO interface
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_AUDIO_Init(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    UNUSED(cfgidx);
    USBD_AUDIO_HandleTypeDef* haudio;

    /* Allocate Audio structure */
    haudio = (USBD_AUDIO_HandleTypeDef*) USBD_malloc(sizeof(USBD_AUDIO_HandleTypeDef));

    if (haudio == NULL)
    {
        pdev->pClassDataCmsit[pdev->classId] = NULL;
        return (uint8_t) USBD_EMEM;
    }

    pdev->pClassDataCmsit[pdev->classId] = (void*) haudio;
    pdev->pClassData                     = pdev->pClassDataCmsit[pdev->classId];

#ifdef USE_USBD_COMPOSITE
    /* Get the Endpoints addresses allocated for this class instance */
    AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
#endif /* USE_USBD_COMPOSITE */

    if (pdev->dev_speed == USBD_SPEED_HIGH)
    {
        pdev->ep_out[AUDIOOutEpAdd & 0xFU].bInterval = AUDIO_HS_BINTERVAL;
    }
    else /* LOW and FULL-speed endpoints */
    {
        pdev->ep_out[AUDIOOutEpAdd & 0xFU].bInterval = AUDIO_FS_BINTERVAL;
    }

    /* Open EP OUT */
    (void) USBD_LL_OpenEP(pdev, AUDIOOutEpAdd, USBD_EP_TYPE_ISOC, AUDIO_OUT_PACKET);
    pdev->ep_out[AUDIOOutEpAdd & 0xFU].is_used = 1U;

    haudio->alt_setting = 0U;
    haudio->offset      = AUDIO_OFFSET_UNKNOWN;
    haudio->wr_ptr      = 0U;
    haudio->rd_ptr      = 0U;
    haudio->rd_enable   = 0U;
    haudio->mic_prime   = 0U;

    /* Initialize the Audio output Hardware layer */
    if (((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->Init(USBD_AUDIO_FREQ, AUDIO_DEFAULT_VOLUME, 0U) != 0U)
    {
        return (uint8_t) USBD_FAIL;
    }

#if 1
    /* Prepare Out endpoint to receive 1st packet */
    (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, haudio->buffer, AUDIO_OUT_PACKET);
#endif

    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_Init
 *         DeInitialize the AUDIO layer
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_AUDIO_DeInit(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    UNUSED(cfgidx);

#ifdef USE_USBD_COMPOSITE
    /* Get the Endpoints addresses allocated for this class instance */
    AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
#endif /* USE_USBD_COMPOSITE */

