yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
    /* Open EP OUT */
    (void) USBD_LL_CloseEP(pdev, AUDIOOutEpAdd);
    pdev->ep_out[AUDIOOutEpAdd & 0xFU].is_used   = 0U;
    pdev->ep_out[AUDIOOutEpAdd & 0xFU].bInterval = 0U;

    /* DeInit  physical Interface components */
    if (pdev->pClassDataCmsit[pdev->classId] != NULL)
    {
        ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->DeInit(0U);
        (void) USBD_free(pdev->pClassDataCmsit[pdev->classId]);
        pdev->pClassDataCmsit[pdev->classId] = NULL;
        pdev->pClassData                     = NULL;
    }

    /* Open EP IN */
#ifdef USE_USBD_COMPOSITE
    AUDIOInEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_IN, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
#endif
    (void) USBD_LL_CloseEP(pdev, AUDIOInEpAdd);
    pdev->ep_in[AUDIOInEpAdd & 0xFU].is_used   = 0U;
    pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = 0U;

    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_Setup
 *         Handle the AUDIO specific requests
 * @param  pdev: instance
 * @param  req: usb requests
 * @retval status
 */
static uint8_t USBD_AUDIO_Setup(USBD_HandleTypeDef* pdev, USBD_SetupReqTypedef* req)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    uint16_t len;
    uint8_t* pbuf;
    uint16_t status_info   = 0U;
    USBD_StatusTypeDef ret = USBD_OK;

    printf("bmReq=%d, bReq=%d, idx=%d, val=%d, len=%d\n", req->bmRequest, req->bRequest, req->wIndex, req->wValue, req->wLength);

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    switch (req->bmRequest & USB_REQ_TYPE_MASK)
    {
    case USB_REQ_TYPE_CLASS:
        switch (req->bRequest)
        {
        case AUDIO_REQ_GET_CUR:
            AUDIO_REQ_GetCurrent(pdev, req);
            break;

        case AUDIO_REQ_SET_CUR:
            AUDIO_REQ_SetCurrent(pdev, req);
            break;

        default:
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
            break;
        }
        break;

    case USB_REQ_TYPE_STANDARD:
        switch (req->bRequest)
        {
        case USB_REQ_GET_STATUS:
            if (pdev->dev_state == USBD_STATE_CONFIGURED)
            {
                (void) USBD_CtlSendData(pdev, (uint8_t*) &status_info, 2U);
            }
            else
            {
                USBD_CtlError(pdev, req);
                ret = USBD_FAIL;
            }
            break;

        case USB_REQ_GET_DESCRIPTOR:
            if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
            {
                pbuf = (uint8_t*) USBD_AUDIO_GetAudioHeaderDesc(pdev->pConfDesc);
                if (pbuf != NULL)
                {
                    len = MIN(USB_AUDIO_DESC_SIZ, req->wLength);
                    (void) USBD_CtlSendData(pdev, pbuf, len);
                }
                else
                {
                    USBD_CtlError(pdev, req);
                    ret = USBD_FAIL;
                }
            }
            break;

        case USB_REQ_GET_INTERFACE:
            if (pdev->dev_state == USBD_STATE_CONFIGURED)
            {
                (void) USBD_CtlSendData(pdev, (uint8_t*) &haudio->alt_setting, 1U);
            }
            else
            {
                USBD_CtlError(pdev, req);
                ret = USBD_FAIL;
            }
            break;

        case USB_REQ_SET_INTERFACE:
#if 0
        	if (pdev->dev_state == USBD_STATE_CONFIGURED)
            {
                if ((uint8_t) (req->wValue) <= USBD_MAX_NUM_INTERFACES)
                {
                    haudio->alt_setting = (uint8_t) (req->wValue);
                }
                else
                {
                    /* Call the error management function (command will be NAKed */
                    USBD_CtlError(pdev, req);
                    ret = USBD_FAIL;
                }
            }
            else
            {
                USBD_CtlError(pdev, req);
                ret = USBD_FAIL;
            }
#else
            if (pdev->dev_state != USBD_STATE_CONFIGURED)
            {
                USBD_CtlError(pdev, req);
                ret = USBD_FAIL;
                break;
            }

            uint8_t ifnum = (uint8_t) (req->wIndex & 0xFF);
            uint8_t alt   = (uint8_t) (req->wValue & 0xFF);

            haudio->alt_setting = alt;  // 既存の動作を踏襲

            /* ---- Speaker: Interface #1 (OUT) ---- */
            if (ifnum == 0x01)
            {
                if (alt == 1)
                {
                    /* 再生開始に備えてリングを初期化し、受信をプライム */
                    haudio->wr_ptr    = 0U;
                    haudio->rd_ptr    = 0U;
                    haudio->rd_enable = 0U;
                    haudio->offset    = AUDIO_OFFSET_UNKNOWN;
                    /* 受信EPをフラッシュしてから最初の受信を投入 */
                    USBD_LL_FlushEP(pdev, AUDIOOutEpAdd);
                    (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], AUDIO_OUT_PACKET);

                    pdev->ep_in[AUDIOFbEpAdd & 0xF].bInterval = AUDIO_FB_BINTERVAL;

                    USBD_LL_OpenEP(pdev, AUDIOFbEpAdd, USBD_EP_TYPE_ISOC, 3);  // 3 bytes
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].is_used   = 1U;
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].maxpacket = 3U;

                    s_fb_busy   = 0; /* ★ busy解除 */
                    s_fb_opened = 1;

                    /* ★ 初回プライム：直近の値を用意して1発アーム */
                    AUDIO_FB_Task_1ms(); /* 値だけ用意 */
                    s_fb_arm_pending = 1;
                }
                else
                {
                    /* Alt=0 に戻る場合はEPをフラッシュ */
                    USBD_LL_FlushEP(pdev, AUDIOOutEpAdd);

                    USBD_LL_CloseEP(pdev, AUDIOFbEpAdd);
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].is_used   = 0U;
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].maxpacket = 0U;

                    s_fb_busy        = 0; /* ★ busy解除 */
                    s_fb_opened      = 0;
                    s_fb_arm_pending = 0;
                }
            }

