yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
            /* ---- Mic: Interface #2 ---- */
            if (ifnum == 0x02)
            {
    #ifdef USE_USBD_COMPOSITE
                AUDIOInEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_IN, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
    #endif

                if (alt == 1)
                {
                    /* IN EP open（Alt=1運用開始） */
                    if (pdev->dev_speed == USBD_SPEED_HIGH)
                    {
                        pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = AUDIO_HS_BINTERVAL;  // HSは通常 4 (=1ms)
                    }
                    else
                    {
                        pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = AUDIO_FS_BINTERVAL;  // FSは 1 (=1ms)
                    }
                    (void) USBD_LL_OpenEP(pdev, AUDIOInEpAdd, USBD_EP_TYPE_ISOC, AUDIO_IN_PACKET);
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].is_used = 1U;

                    haudio->mic_prime = 1;

                    s_fb_opened_in = 1;
                }
                else
                {
                    /* Alt=0: IN EP停止 */
                    (void) USBD_LL_CloseEP(pdev, AUDIOInEpAdd);
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].is_used   = 0U;
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = 0U;

                    s_fb_opened_in = 0;
                }
            }

            /* 標準リクエストの応答 */
            (void) USBD_CtlSendStatus(pdev);
#endif
            break;

        case USB_REQ_CLEAR_FEATURE:
            break;

        default:
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
            break;
        }
        break;
    default:
        USBD_CtlError(pdev, req);
        ret = USBD_FAIL;
        break;
    }

    return (uint8_t) ret;
}

#ifndef USE_USBD_COMPOSITE
/**
 * @brief  USBD_AUDIO_GetCfgDesc
 *         return configuration descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_AUDIO_GetCfgDesc(uint16_t* length)
{
    *length = (uint16_t) sizeof(USBD_AUDIO_CfgDesc);

    return USBD_AUDIO_CfgDesc;
}
#endif /* USE_USBD_COMPOSITE  */
/**
 * @brief  USBD_AUDIO_DataIn
 *         handle data IN Stage
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_DataIn(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
#if 0
    if (pdev->dev_state != USBD_STATE_CONFIGURED)
        return (uint8_t) USBD_OK;
#endif
    if ((epnum & 0x0F) == (AUDIOInEpAdd & 0x0F))
    {
        (void) AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET);
        (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);

        // printf("data in!\n");
    }

    /* epnum は EP番号(0..15)。アドレスではない点に注意 */
    if ((epnum & 0x0F) == (AUDIOFbEpAdd & 0x0F))
    {
        s_fb_busy = 0; /* ★ 完了で busy を確実に落とす */
        g_fb_ack++;    /* ★ ACK をカウント */

        /* ★ ACKが来たら、その場で次回分をアーム */
        if (!s_fb_arm_pending)
        {
            s_fb_arm_pending = 1;
        }

        return (uint8_t) USBD_OK;
    }

    /* Only OUT data are processed */
    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_EP0_RxReady
 *         handle EP0 Rx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_EP0_RxReady(USBD_HandleTypeDef* pdev)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    if (haudio->control.cmd == AUDIO_REQ_SET_CUR)
    {
        /* In this driver, to simplify code, only SET_CUR request is managed */

        if (haudio->control.unit == AUDIO_OUT_STREAMING_CTRL)
        {
            ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->MuteCtl(haudio->control.data[0]);
            haudio->control.cmd = 0U;
            haudio->control.len = 0U;
        }
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_EP0_TxReady
 *         handle EP0 TRx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_EP0_TxReady(USBD_HandleTypeDef* pdev)
{
    UNUSED(pdev);

    /* Only OUT control data are processed */
    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_SOF
 *         handle SOF event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_SOF(USBD_HandleTypeDef* pdev)
{
    static int8_t s_fb_poll_uframe = -1;

    USBD_EndpointTypeDef ep = pdev->ep_in[AUDIOFbEpAdd & 0xF];
    if (pdev->dev_state != USBD_STATE_CONFIGURED || !ep.is_used || ep.maxpacket == 0)
        return (uint8_t) USBD_OK;

#if 1
    if (pdev && pdev->dev_state == USBD_STATE_CONFIGURED && s_fb_opened)
    {
        uint8_t uf      = USBD_GetMicroframeHS();
        bool poll_match = (s_fb_poll_uframe < 0) ? (uf == 0) : (uf == (uint8_t) s_fb_poll_uframe);
        if (s_fb_arm_pending && !s_fb_busy && poll_match)
        {
            AUDIO_FB_Task_1ms();
            __DMB();
            if (USBD_LL_Transmit(pdev, AUDIOFbEpAdd, s_fb_pkt, 3) == USBD_OK)
            {
                s_fb_busy        = 1;
                s_fb_arm_pending = 0;
                g_fb_tx_req++;
                g_fb_tx_ok++;

                // 初回成功で“ホストが実際にポーリングしていたµframe”を学習
                if (s_fb_poll_uframe < 0)
                {
                    s_fb_poll_uframe = (int8_t) uf;
                }
            }
            else
            {
                g_fb_tx_busy++;
            }
    #if 0
            static uint32_t last = 0;
            uint32_t now         = HAL_GetTick();
            if ((now - last) >= 1000)
            {
                USB_OTG_INEndpointTypeDef* in =
                    (USB_OTG_INEndpointTypeDef*) ((uint32_t) USB_OTG_HS + USB_OTG_IN_ENDPOINT_BASE);
                uint8_t idx = (uint8_t) (AUDIOFbEpAdd & 0x0F);
                printf("[FB:sof] DIEPCTL=0x%08lX DIEPTSIZ=0x%08lX\n", (unsigned long) in[idx].DIEPCTL, (unsigned long) in[idx].DIEPTSIZ);
                last = now;
            }
    #endif

