yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
    #if 0
            static uint32_t last_ms = 0;
            const uint32_t now      = HAL_GetTick();
            if ((now - last_ms) >= 1000)
            {
                AUDIO_Stats_On1sTick(); /* ← 1秒境界で確定 */
                AUDIO_Stats st;
                AUDIO_GetStats(&st);
                printf("[AUDIO] cap=%u frm, level[now/min/max]=%u/%u/%u, "
                       "fps[in/out]=%u/%u, dLevel/s=%ld, "
                       "UR(ev=%u,frm=%u), OR(ev=%u,frm=%u), copy_us(last=%u,max=%u)\n",
                       st.rxq_capacity_frames, st.rxq_level_now, st.rxq_level_min, st.rxq_level_max, st.in_fps, st.out_fps, (long) st.dlevel_per_s, st.underrun_events, st.underrun_frames, st.overrun_events, st.overrun_frames, st.copy_us_last, st.copy_us_max);

                last_ms = now;
            }
    #endif
        }
    }
#endif

    if (s_fb_opened_in)
    {
        USBD_AUDIO_HandleTypeDef* haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];
        if (!haudio)
        {
            return (uint8_t) USBD_OK;
        }

        /* alt=1 が選択され、まだ初回送信していない？ */
        if (haudio->alt_setting == 1 && haudio->mic_prime)
        {
            /* いったんフラッシュして、フレーム境界(1ms)に揃えて送る */
            USBD_LL_FlushEP(pdev, AUDIOInEpAdd);
            AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET);
            USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);
            haudio->mic_prime = 0;

            printf("first transmit.\n");
        }
    }

    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_SOF
 *         handle SOF event
 * @param  pdev: device instance
 * @param  offset: audio offset
 * @retval status
 */
void USBD_AUDIO_Sync(USBD_HandleTypeDef* pdev, AUDIO_OffsetTypeDef offset)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    uint32_t BufferSize = AUDIO_TOTAL_BUF_SIZE / 2U;

    if (pdev->pClassDataCmsit[pdev->classId] == NULL)
    {
        return;
    }

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    haudio->offset = offset;

    if (haudio->rd_enable == 1U)
    {
        haudio->rd_ptr += (uint16_t) BufferSize;

        if (haudio->rd_ptr == AUDIO_TOTAL_BUF_SIZE)
        {
            /* roll back */
            haudio->rd_ptr = 0U;
        }
    }

    if (haudio->rd_ptr > haudio->wr_ptr)
    {
        if ((haudio->rd_ptr - haudio->wr_ptr) < AUDIO_OUT_PACKET)
        {
            BufferSize += 4U;
        }
        else
        {
            if ((haudio->rd_ptr - haudio->wr_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET))
            {
                BufferSize -= 4U;
            }
        }
    }
    else
    {
        if ((haudio->wr_ptr - haudio->rd_ptr) < AUDIO_OUT_PACKET)
        {
            BufferSize -= 4U;
        }
        else
        {
            if ((haudio->wr_ptr - haudio->rd_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET))
            {
                BufferSize += 4U;
            }
        }
    }

    if (haudio->offset == AUDIO_OFFSET_FULL)
    {
        ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->AudioCmd(&haudio->buffer[0], BufferSize, AUDIO_CMD_PLAY);
        haudio->offset = AUDIO_OFFSET_NONE;
    }
}

/**
 * @brief  USBD_AUDIO_IsoINIncomplete
 *         handle data ISO IN Incomplete event
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
#include "stm32h7rsxx_ll_usb.h"
#define USB_OTG_BASE_ADDRESS USB_OTG_HS

#define USB_DIEPCTL(ep_addr) ((USB_OTG_INEndpointTypeDef*) ((uint32_t) USB_OTG_BASE_ADDRESS + USB_OTG_IN_ENDPOINT_BASE + (ep_addr & 0x7FU) * USB_OTG_EP_REG_SIZE))->DIEPCTL
#define USB_DOEPCTL(ep_addr) ((USB_OTG_OUTEndpointTypeDef*) ((uint32_t) USB_OTG_BASE_ADDRESS + USB_OTG_OUT_ENDPOINT_BASE + (ep_addr) * USB_OTG_EP_REG_SIZE))->DOEPCTL

#define USB_CLEAR_INCOMPLETE_IN_EP(ep_addr)                                     \
    if ((((ep_addr) & 0x80U) == 0x80U))                                         \
    {                                                                           \
        USB_DIEPCTL(ep_addr) |= (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK); \
    };

static uint8_t USBD_AUDIO_IsoINIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    if ((epnum & 0x0F) == (AUDIOInEpAdd & 0x0F))
    {
        (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);

        // printf("incomplete...\n");
    }

    if ((epnum & 0x0F) == (AUDIOFbEpAdd & 0x0F))
    {
        s_fb_busy = 0; /* ★ 完了しなくても次回送れるように busy を解放 */
        g_fb_incomp++;

        USB_CLEAR_INCOMPLETE_IN_EP(AUDIOFbEpAdd);
        USBD_LL_FlushEP(pdev, AUDIOFbEpAdd);
        __DMB();

        /* ★ 未成立でも“すぐ次回分”をアーム（次のmsで間に合うよう先行） */
        if (!s_fb_arm_pending)
        {
            s_fb_arm_pending = 1;
        }
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_IsoOutIncomplete
 *         handle data ISO OUT Incomplete event
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_IsoOutIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    USBD_AUDIO_HandleTypeDef* haudio;

    if (pdev->pClassDataCmsit[pdev->classId] == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if ((epnum & 0x0F) == (AUDIOOutEpAdd & 0x0F))
    {
#if 0
        uint32_t USBx_BASE = USB_OTG_HS;
        uint32_t ctl       = USBx_OUTEP(epnum & 0x0f)->DOEPCTL;
        uint32_t siz       = USBx_OUTEP(epnum & 0x0f)->DOEPTSIZ;
        printf("[OUT:INC] DOEPCTL=%08lX DOEPTSIZ=%08lX\n", ctl, siz);
#endif

#if 1
        /* Prepare Out endpoint to receive next audio packet */
        (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], AUDIO_OUT_PACKET);
#endif
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_DataOut
 *         handle data OUT Stage
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    uint16_t PacketSize;
    USBD_AUDIO_HandleTypeDef* haudio;

