yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
#ifdef USE_USBD_COMPOSITE
    /* Get the Endpoints addresses allocated for this class instance */
    AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
#endif /* USE_USBD_COMPOSITE */

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    if ((epnum & 0x0F) == (AUDIOOutEpAdd & 0x0F))
    {
        /* Get received data packet length */
        PacketSize = (uint16_t) USBD_LL_GetRxDataSize(pdev, AUDIOOutEpAdd);

        /* Packet received Callback */
        ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->PeriodicTC(&haudio->buffer[haudio->wr_ptr], PacketSize, AUDIO_OUT_TC);

        /* Increment the Buffer pointer or roll it back when all buffers are full */
        haudio->wr_ptr += PacketSize;

        if (haudio->wr_ptr >= AUDIO_TOTAL_BUF_SIZE - PacketSize)
        {
            /* All buffers are full: roll back */
            haudio->wr_ptr = 0U;

            if (haudio->offset == AUDIO_OFFSET_UNKNOWN)
            {
                ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->AudioCmd(&haudio->buffer[0], AUDIO_TOTAL_BUF_SIZE / 2U, AUDIO_CMD_START);
                haudio->offset = AUDIO_OFFSET_NONE;
            }
        }

        if (haudio->rd_enable == 0U)
        {
            if (haudio->wr_ptr == (AUDIO_TOTAL_BUF_SIZE / 2U))
            {
                haudio->rd_enable = 1U;
            }
        }

        /* Prepare Out endpoint to receive next audio packet */
        (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], PacketSize);
    }

    return (uint8_t) USBD_OK;
}

/**
 * @brief  AUDIO_Req_GetCurrent
 *         Handles the GET_CUR Audio control request.
 * @param  pdev: device instance
 * @param  req: setup class request
 * @retval status
 */
static void AUDIO_REQ_GetCurrent(USBD_HandleTypeDef* pdev, USBD_SetupReqTypedef* req)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return;
    }

    (void) USBD_memset(haudio->control.data, 0, USB_MAX_EP0_SIZE);

    /* Send the current mute state */
    (void) USBD_CtlSendData(pdev, haudio->control.data, MIN(req->wLength, USB_MAX_EP0_SIZE));
}

/**
 * @brief  AUDIO_Req_SetCurrent
 *         Handles the SET_CUR Audio control request.
 * @param  pdev: device instance
 * @param  req: setup class request
 * @retval status
 */
static void AUDIO_REQ_SetCurrent(USBD_HandleTypeDef* pdev, USBD_SetupReqTypedef* req)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return;
    }

    if (req->wLength != 0U)
    {
        haudio->control.cmd  = AUDIO_REQ_SET_CUR;                             /* Set the request value */
        haudio->control.len  = (uint8_t) MIN(req->wLength, USB_MAX_EP0_SIZE); /* Set the request data length */
        haudio->control.unit = HIBYTE(req->wIndex);                           /* Set the request target unit */

        /* Prepare the reception of the buffer over EP0 */
        (void) USBD_CtlPrepareRx(pdev, haudio->control.data, haudio->control.len);
    }
}

#ifndef USE_USBD_COMPOSITE
/**
 * @brief  DeviceQualifierDescriptor
 *         return Device Qualifier descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_AUDIO_GetDeviceQualifierDesc(uint16_t* length)
{
    *length = (uint16_t) sizeof(USBD_AUDIO_DeviceQualifierDesc);

    return USBD_AUDIO_DeviceQualifierDesc;
}
#endif /* USE_USBD_COMPOSITE  */
/**
 * @brief  USBD_AUDIO_RegisterInterface
 * @param  pdev: device instance
 * @param  fops: Audio interface callback
 * @retval status
 */
uint8_t USBD_AUDIO_RegisterInterface(USBD_HandleTypeDef* pdev, USBD_AUDIO_ItfTypeDef* fops)
{
    if (fops == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    pdev->pUserData[pdev->classId] = fops;

    return (uint8_t) USBD_OK;
}

#ifdef USE_USBD_COMPOSITE
/**
 * @brief  USBD_AUDIO_GetEpPcktSze
 * @param  pdev: device instance (reserved for future use)
 * @param  If: Interface number (reserved for future use)
 * @param  Ep: Endpoint number (reserved for future use)
 * @retval status
 */
uint32_t USBD_AUDIO_GetEpPcktSze(USBD_HandleTypeDef* pdev, uint8_t If, uint8_t Ep)
{
    uint32_t mps;

    UNUSED(pdev);
    UNUSED(If);
    UNUSED(Ep);

    mps = AUDIO_PACKET_SZE_WORD(USBD_AUDIO_FREQ);

    /* Return the wMaxPacketSize value in Bytes (Freq(Samples)*2(Stereo)*2(HalfWord)) */
    return mps;
}
#endif /* USE_USBD_COMPOSITE */

/**
 * @brief  USBD_AUDIO_GetAudioHeaderDesc
 *         This function return the Audio descriptor
 * @param  pdev: device instance
 * @param  pConfDesc:  pointer to Bos descriptor
 * @retval pointer to the Audio AC Header descriptor
 */
static void* USBD_AUDIO_GetAudioHeaderDesc(uint8_t* pConfDesc)
{
    USBD_ConfigDescTypeDef* desc  = (USBD_ConfigDescTypeDef*) (void*) pConfDesc;
    USBD_DescHeaderTypeDef* pdesc = (USBD_DescHeaderTypeDef*) (void*) pConfDesc;
    uint8_t* pAudioDesc           = NULL;
    uint16_t ptr;

    if (desc->wTotalLength > desc->bLength)
    {
        ptr = desc->bLength;

        while (ptr < desc->wTotalLength)
        {
            pdesc = USBD_GetNextDesc((uint8_t*) pdesc, &ptr);
            if ((pdesc->bDescriptorType == AUDIO_INTERFACE_DESCRIPTOR_TYPE) &&
                (pdesc->bDescriptorSubType == AUDIO_CONTROL_HEADER))
            {
                pAudioDesc = (uint8_t*) pdesc;
                break;
            }
        }
    }
    return pAudioDesc;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
